In [1]:
import requests
from bs4 import BeautifulSoup

In [6]:
import pandas as pd

In [2]:
url = 'https://www.bok.or.kr/portal/singl/baseRate/list.do?dataSeCd=01&menuNo=200643'
resp = requests.get(url)

In [3]:
soup = BeautifulSoup(resp.content, 'lxml')

In [4]:
td_tag = soup.select('tbody tr td')

In [7]:
import re
date = []
price = []
for i in range(len(td_tag)):
  if i % 3 ==0:
    datee = ''
    datee += td_tag[i].text
  elif i % 3 ==1:
    datee += td_tag[i].text
    date.append(''.join(re.findall('[0-9]+', datee)))
  else:
    price.append(td_tag[i].text)

selected = {}
selected['date'] = date
selected['interest_rate'] = price
features = pd.DataFrame(selected)

In [14]:
features
for i in range(len(features['date'])):
    features['date'][i] = str(features['date'][i])[:4]+'.'+str(features['date'][i])[4:6]+'.'+str(features['date'][i])[6:]
features['date']

0     2020.05.28
1     2020.03.17
2     2019.10.16
3     2019.07.18
4     2018.11.30
5     2017.11.30
6     2016.06.09
7     2015.06.11
8     2015.03.12
9     2014.10.15
10    2014.08.14
11    2013.05.09
12    2012.10.11
13    2012.07.12
14    2011.06.10
15    2011.03.10
16    2011.01.13
17    2010.11.16
18    2010.07.09
19    2009.02.12
20    2009.01.09
21    2008.12.11
22    2008.11.07
23    2008.10.27
24    2008.10.09
25    2008.08.07
26    2007.08.09
27    2007.07.12
28    2006.08.10
29    2006.06.08
30    2006.02.09
31    2005.12.08
32    2005.10.11
33    2004.11.11
34    2004.08.12
35    2003.07.10
36    2003.05.13
37    2002.05.07
38    2001.09.19
39    2001.08.09
40    2001.07.05
41    2001.02.08
42    2000.10.05
43    2000.02.10
44    1999.05.06
Name: date, dtype: object

In [39]:
len(td_tag) / 3

45.0

In [ ]:
# 그냥 이렇게 어렵게 가지 말고 DataFrame, Date날짜를 넣어서 만들어서 정리하자

In [9]:
from datetime import datetime, timedelta

In [10]:
start_date = datetime.strptime('20050101', '%Y%m%d')
end_date = datetime.strptime('20171231','%Y%m%d' )

str_date_list = [] 
while start_date.strftime('%Y%m%d') != end_date.strftime('%Y%m%d'):
    str_date_list.append(start_date.strftime('%Y%m%d')) 
    start_date += timedelta(days=1)

In [13]:
whole = pd.DataFrame(str_date_list, columns = ['date'])
for i in range(len(whole['date'])):
    whole['date'][i] = str(whole['date'][i])[:4]+'.'+str(whole['date'][i])[4:6]+'.'+str(whole['date'][i])[6:]
whole['date']

0       2005.01.01
1       2005.01.02
2       2005.01.03
3       2005.01.04
4       2005.01.05
           ...
4742    2017.12.26
4743    2017.12.27
4744    2017.12.28
4745    2017.12.29
4746    2017.12.30
Name: date, Length: 4747, dtype: object

In [15]:
merged = pd.merge(whole, features, how = 'left')
merged['interest_rate'][0] = 3.25
merged

            date interest_rate
0     2005.01.01          3.25
1     2005.01.02           NaN
2     2005.01.03           NaN
3     2005.01.04           NaN
4     2005.01.05           NaN
...          ...           ...
4742  2017.12.26           NaN
4743  2017.12.27           NaN
4744  2017.12.28           NaN
4745  2017.12.29           NaN
4746  2017.12.30           NaN

[4747 rows x 2 columns]

In [16]:
merged = merged.fillna(method = 'ffill')

In [17]:
merged

            date interest_rate
0     2005.01.01          3.25
1     2005.01.02          3.25
2     2005.01.03          3.25
3     2005.01.04          3.25
4     2005.01.05          3.25
...          ...           ...
4742  2017.12.26          1.50
4743  2017.12.27          1.50
4744  2017.12.28          1.50
4745  2017.12.29          1.50
4746  2017.12.30          1.50

[4747 rows x 2 columns]

In [20]:
merged.to_csv('interest.csv', index=False)

In [21]:
pd.read_csv('interest.csv')

            date  interest_rate
0     2005.01.01           3.25
1     2005.01.02           3.25
2     2005.01.03           3.25
3     2005.01.04           3.25
4     2005.01.05           3.25
...          ...            ...
4742  2017.12.26           1.50
4743  2017.12.27           1.50
4744  2017.12.28           1.50
4745  2017.12.29           1.50
4746  2017.12.30           1.50

[4747 rows x 2 columns]